{
    "feature": "Stretch Tether Mechanic",
    "items": [
        {
            "id": "TETHER-001",
            "category": "Types",
            "description": "Add TetherEndpoint and TetherMechanicState types to src/shared/types.ts. TetherEndpoint is a discriminated union: { type: 'player'; playerId: string } | { type: 'point'; x: number; y: number }. TetherMechanicState has: type: 'tether', id: string, endpointA: TetherEndpoint, endpointB: TetherEndpoint, requiredDistance: number, damage: number, startTime: number, endTime: number. Add TetherMechanicState to the MechanicState union type.",
            "stepsToVerify": [
                "Run 'npm run build' and confirm no TypeScript errors",
                "Verify TetherEndpoint type exists with both 'player' and 'point' variants",
                "Verify TetherMechanicState interface has all required fields",
                "Verify MechanicState union includes TetherMechanicState"
            ],
            "passes": true
        },
        {
            "id": "TETHER-002",
            "category": "Server",
            "description": "Create src/server/mechanics/tether.ts implementing BaseMechanic interface. Constructor takes: id, endpointA, endpointB, requiredDistance, damage, startTime, endTime. tick() is no-op. isExpired(now) returns true when now >= endTime. resolve() method: 1) Resolve each endpoint position (if player type, lookup player position; if point type, use x/y directly), 2) Calculate Euclidean distance between endpoints, 3) If distance < requiredDistance, call takeDamage(damage) on all players connected to this tether (any endpoint with type='player'). toState() returns TetherMechanicState object.",
            "stepsToVerify": [
                "Run 'npm run build' and confirm no TypeScript errors",
                "Verify tether.ts exports a class implementing BaseMechanic",
                "Verify resolve() correctly identifies player endpoints and applies damage only when distance < requiredDistance",
                "Verify toState() returns properly typed TetherMechanicState"
            ],
            "passes": true
        },
        {
            "id": "TETHER-003",
            "category": "Server",
            "description": "Add admin:spawnMechanic handlers in src/server/index.ts for 'pointTethers' and 'playerTethers' types. For 'pointTethers': create one tether per player, connecting each player to point {x: ARENA_WIDTH/2, y: 0} (top center). For 'playerTethers': if fewer than 2 players, do nothing; otherwise pick 2 random different players and create 1 tether between them. Both use: requiredDistance = ARENA_WIDTH * 0.75, duration = 3000ms, damage = 100. Register created tethers with mechanicsManager.",
            "stepsToVerify": [
                "Run 'npm run build' and confirm no TypeScript errors",
                "Using Playwright: join 2 players, click spawn point tethers button, verify __gameTest.getGameState().mechanics contains 2 tether mechanics with point endpoints at arena top center",
                "Using Playwright: join 2 players, click spawn player tethers button, verify __gameTest.getGameState().mechanics contains 1 tether mechanic with both endpoints as player type"
            ],
            "passes": true
        },
        {
            "id": "TETHER-004",
            "category": "Client",
            "description": "Add two admin buttons to public/index.html in the admin panel: 1) id='spawn-point-tethers-btn' with text 'Create Point Tethers', 2) id='spawn-player-tethers-btn' with text 'Create Player Tethers'. In src/client/admin.ts, add click handlers that emit 'admin:spawnMechanic' with type='pointTethers' and type='playerTethers' respectively.",
            "stepsToVerify": [
                "Run 'npm run build' and confirm no TypeScript errors",
                "Using Playwright: navigate to game, verify button #spawn-point-tethers-btn exists with correct text",
                "Using Playwright: verify button #spawn-player-tethers-btn exists with correct text",
                "Using Playwright: click each button and verify socket emits correct event (check network or game state changes)"
            ],
            "passes": true
        },
        {
            "id": "TETHER-005",
            "category": "Client",
            "description": "Add renderTether() function in src/client/mechanics.ts. Calculate current distance between endpoints using interpolated/predicted player positions. UNSTRETCHED STATE (distance < requiredDistance): Draw thick (~6px) pink/magenta line (#ff66aa) between endpoints. Draw static chevron/thorn shapes along the line pointing toward the closer endpoint. Chevron spacing should scale proportionally with distance (further apart as tether stretches). STRETCHED STATE (distance >= requiredDistance): Draw thin (~2px) bright orange/yellow line (#ffcc00) with prominent glow effect (use canvas shadowBlur). No chevrons. Visual must update in real-time every frame based on current distance.",
            "stepsToVerify": [
                "Run 'npm run build' and confirm no TypeScript errors",
                "Using Playwright: join a player, spawn point tethers, take screenshot, verify pink line visible from player toward top center",
                "Using Playwright: move player far from top center (>75% arena width), take screenshot, verify line changes to thin orange/yellow with glow",
                "Using Playwright: move player back close to top center, verify line changes back to pink with chevrons"
            ],
            "passes": true
        },
        {
            "id": "TETHER-006",
            "category": "Client",
            "description": "Add tether mechanic display to debug panel in src/client/debug.ts. Tether mechanics should appear as .debug-mechanic elements with data-type='tether'. Include data attributes for mechanic id, endpoint info, and required distance.",
            "stepsToVerify": [
                "Run 'npm run build' and confirm no TypeScript errors",
                "Using Playwright: navigate with ?debug=1, join player, spawn point tethers",
                "Verify .debug-mechanic[data-type='tether'] element exists in debug panel"
            ],
            "passes": true
        },
        {
            "id": "TETHER-007",
            "category": "Server",
            "description": "When tether mechanic resolves, emit a socket event to notify clients of the result. Event should include: mechanic id, success (boolean - true if stretched enough, false if not), and list of affected player ids (those who took damage). This enables client-side toast feedback.",
            "stepsToVerify": [
                "Run 'npm run build' and confirm no TypeScript errors",
                "Verify server emits tether resolution event when mechanic expires",
                "Event payload includes mechanicId, success boolean, and affectedPlayerIds array"
            ],
            "passes": true
        },
        {
            "id": "TETHER-008",
            "category": "Client",
            "description": "Listen for tether resolution events on the client. When received, show toast: 'Tether snapped!' if success=false (tether was not stretched enough), or 'Tether stretched!' if success=true. Use existing toast system (__toastTest.showToast or equivalent).",
            "stepsToVerify": [
                "Run 'npm run build' and confirm no TypeScript errors",
                "Using Playwright: join player, spawn point tethers, stay close to top center, wait 3 seconds for resolve",
                "Verify toast 'Tether snapped!' appears",
                "Using Playwright: join player, spawn point tethers, move far from top center, wait for resolve",
                "Verify toast 'Tether stretched!' appears"
            ],
            "passes": true
        },
        {
            "id": "TETHER-009",
            "category": "Integration",
            "description": "End-to-end damage test: When tether resolves and distance < requiredDistance (75% arena width), all players attached to that tether take 100 damage. When distance >= requiredDistance, no damage is dealt.",
            "stepsToVerify": [
                "Using Playwright: join player (starts at 100 HP), spawn point tether, stay near top center (distance < 75% arena)",
                "Wait for tether to resolve (3 seconds), verify player HP is now 0 (100 - 100 damage)",
                "Using Playwright: heal player, spawn new point tether, move player far from top center (distance >= 75% arena)",
                "Wait for tether to resolve, verify player HP remains 100 (no damage taken)"
            ],
            "passes": true
        },
        {
            "id": "TETHER-010",
            "category": "Integration",
            "description": "Player-to-player tether test: When playerTethers is spawned with 2+ players, creates exactly one tether between two random players. Both connected players take damage if they don't stretch the tether far enough apart.",
            "stepsToVerify": [
                "Using Playwright: open 2 browser contexts, join 2 different players",
                "Click spawn player tethers button, verify exactly 1 tether mechanic exists",
                "Verify tether connects the two different players (both endpoints are player type with different playerIds)",
                "Keep both players close together, wait for resolve, verify both players took 100 damage"
            ],
            "passes": true
        }
    ]
}
